VerifyNonEsiMecService.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
   <soap:Header>
      <wsse:Security soap:mustUnderstand="1" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
         <saml2:Assertion Version="2.0" ID="SAML-4f90ae32-0e29-4cae-a9ac-2c168c39b1a9" IssueInstant="2014-11-03T02:57:33Z" xmlns:saml2="urn:oasis:names:tc:SAML:2.0:assertion">
            <saml2:Issuer>cloudservicegateway-stg.optum.com</saml2:Issuer>
            <saml2:Subject>
               <saml2:NameID Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified">uid=MA_002_002_USER,ou=appIDs,ou=admin,dc=optumX,dc=com</saml2:NameID>
               <saml2:SubjectConfirmation Method="urn:oasis:names:tc:SAML:2.0:cm:bearer">
                  <saml2:SubjectConfirmationData NotBefore="2014-11-03T02:57:03Z" NotOnOrAfter="2014-11-03T03:03:03Z"/>
               </saml2:SubjectConfirmation>
            </saml2:Subject>
            <saml2:Conditions NotBefore="2014-11-03T02:57:03Z" NotOnOrAfter="2014-11-03T03:03:03Z"/>
            <saml2:AuthnStatement AuthnInstant="2014-11-03T02:57:33Z" SessionNotOnOrAfter="2014-11-03T03:03:03Z">
               <saml2:SubjectLocality Address="10.119.52.7"/>
               <saml2:AuthnContext>
                  <saml2:AuthnContextClassRef>urn:oasis:names:tc:SAML:2.0:ac:classes:unspecified</saml2:AuthnContextClassRef>
               </saml2:AuthnContext>
            </saml2:AuthnStatement>
         </saml2:Assertion>
      </wsse:Security>
   </soap:Header>
   <soap:Body>
      <ns2:VerifyNonESIMECRequest xmlns:ns1="http://niem.gov/niem/structures/2.0" xmlns:ns2="http://vnem.ee.sim.dsh.cms.hhs.gov" xmlns:ns3="http://niem.gov/niem/niem-core/2.0" xmlns:ns4="http://hix.cms.gov/0.1/hix-core" xmlns:ns5="http://hix.cms.gov/0.1/hix-ee" xmlns:ns6="http://extn.ssac.ee.sim.dsh.cms.hhs.gov" xmlns:ns7="http://ifsv.dsh.cms.gov/extension/1.0" xmlns:ns8="http://niem.gov/niem/appinfo/2.0" xmlns:ns9="http://niem.gov/niem/appinfo/2.1">
         <ns2:IndividualRequest>
            <ns2:Applicant>
               <ns2:PersonSSNIdentification>104943105</ns2:PersonSSNIdentification>
               <ns2:PersonName>
                  <ns2:PersonGivenName>Joe</ns2:PersonGivenName>
                  <ns2:PersonSurName>Wharftop</ns2:PersonSurName>
               </ns2:PersonName>
               <ns3:PersonBirthDate>
                  <ns3:Date>1993-03-27</ns3:Date>
               </ns3:PersonBirthDate>
               <ns3:PersonSexCode>M</ns3:PersonSexCode>
            </ns2:Applicant>
            <ns3:LocationStateUSPostalServiceCode>MA</ns3:LocationStateUSPostalServiceCode>
            <ns2:InsurancePolicy>
               <ns2:InsurancePolicyEffectiveDate>2015-01-01</ns2:InsurancePolicyEffectiveDate>
               <ns2:InsurancePolicyExpirationDate>2015-12-31</ns2:InsurancePolicyExpirationDate>
            </ns2:InsurancePolicy>
            <ns2:Organization>
               <ns2:OrganizationCode>MEDI</ns2:OrganizationCode>
               <ns2:OrganizationCode>VHPC</ns2:OrganizationCode>
               <ns2:OrganizationCode>TRIC</ns2:OrganizationCode>
               <ns2:OrganizationCode>PECO</ns2:OrganizationCode>
            </ns2:Organization>
         </ns2:IndividualRequest>
         <ns2:IndividualRequest>
            <ns2:Applicant>
               <ns2:PersonSSNIdentification>036033109</ns2:PersonSSNIdentification>
               <ns2:PersonName>
                  <ns2:PersonGivenName>Barbie</ns2:PersonGivenName>
                  <ns2:PersonSurName>Brown</ns2:PersonSurName>
               </ns2:PersonName>
               <ns3:PersonBirthDate>
                  <ns3:Date>1950-05-14</ns3:Date>
               </ns3:PersonBirthDate>
               <ns3:PersonSexCode>F</ns3:PersonSexCode>
            </ns2:Applicant>
            <ns3:LocationStateUSPostalServiceCode>MA</ns3:LocationStateUSPostalServiceCode>
            <ns2:InsurancePolicy>
               <ns2:InsurancePolicyEffectiveDate>2015-01-01</ns2:InsurancePolicyEffectiveDate>
               <ns2:InsurancePolicyExpirationDate>2015-12-31</ns2:InsurancePolicyExpirationDate>
            </ns2:InsurancePolicy>
            <ns2:Organization>
               <ns2:OrganizationCode>MEDI</ns2:OrganizationCode>
               <ns2:OrganizationCode>VHPC</ns2:OrganizationCode>
               <ns2:OrganizationCode>TRIC</ns2:OrganizationCode>
               <ns2:OrganizationCode>PECO</ns2:OrganizationCode>
            </ns2:Organization>
         </ns2:IndividualRequest>
         <ns2:IndividualRequest>
            <ns2:Applicant>
               <ns2:PersonSSNIdentification>013570201</ns2:PersonSSNIdentification>
               <ns2:PersonName>
                  <ns2:PersonGivenName>Russian</ns2:PersonGivenName>
                  <ns2:PersonSurName>json</ns2:PersonSurName>
               </ns2:PersonName>
               <ns3:PersonBirthDate>
                  <ns3:Date>2012-06-21</ns3:Date>
               </ns3:PersonBirthDate>
               <ns3:PersonSexCode>F</ns3:PersonSexCode>
            </ns2:Applicant>
            <ns3:LocationStateUSPostalServiceCode>MA</ns3:LocationStateUSPostalServiceCode>
            <ns2:InsurancePolicy>
               <ns2:InsurancePolicyEffectiveDate>2015-01-01</ns2:InsurancePolicyEffectiveDate>
               <ns2:InsurancePolicyExpirationDate>2015-12-31</ns2:InsurancePolicyExpirationDate>
            </ns2:InsurancePolicy>
            <ns2:Organization>
               <ns2:OrganizationCode>MEDI</ns2:OrganizationCode>
               <ns2:OrganizationCode>VHPC</ns2:OrganizationCode>
               <ns2:OrganizationCode>TRIC</ns2:OrganizationCode>
               <ns2:OrganizationCode>PECO</ns2:OrganizationCode>
            </ns2:Organization>
         </ns2:IndividualRequest>
         <ns2:IndividualRequest>
            <ns2:Applicant>
               <ns2:PersonSSNIdentification>028053700</ns2:PersonSSNIdentification>
               <ns2:PersonName>
                  <ns2:PersonGivenName>William</ns2:PersonGivenName>
                  <ns2:PersonSurName>Julbrot</ns2:PersonSurName>
               </ns2:PersonName>
               <ns3:PersonBirthDate>
                  <ns3:Date>1994-10-19</ns3:Date>
               </ns3:PersonBirthDate>
               <ns3:PersonSexCode>F</ns3:PersonSexCode>
            </ns2:Applicant>
            <ns3:LocationStateUSPostalServiceCode>MA</ns3:LocationStateUSPostalServiceCode>
            <ns2:InsurancePolicy>
               <ns2:InsurancePolicyEffectiveDate>2015-01-01</ns2:InsurancePolicyEffectiveDate>
               <ns2:InsurancePolicyExpirationDate>2015-12-31</ns2:InsurancePolicyExpirationDate>
            </ns2:InsurancePolicy>
            <ns2:Organization>
               <ns2:OrganizationCode>MEDI</ns2:OrganizationCode>
               <ns2:OrganizationCode>VHPC</ns2:OrganizationCode>
               <ns2:OrganizationCode>TRIC</ns2:OrganizationCode>
               <ns2:OrganizationCode>PECO</ns2:OrganizationCode>
            </ns2:Organization>
         </ns2:IndividualRequest>
      </ns2:VerifyNonESIMECRequest>
   </soap:Body>
</soap:Envelope>